[
    {
        "time": "NOV 2019 - PRESENT",
        "company": "GE Aviation",
        "location": "Austin Tx",
        "title": "Staff Software Engineer",
        "summary": "",
        "points": [
            "Designed, architect, and updated latest UI to handle multi tenancy.",
            "Implemented a shared UI library of components for our umbrella of products using Vue/Angular. Underlying design was built on Material Design.",
            "Worked on a UI unification process across teams and products. Involved a move from multiple code stacks and I provided migration paths with metrics on new infrastructure standards.",
            "Led the Node/Javascript migration initiative from GE Artifactory to Azure Devops.",
            "I built an Azure Pipeline to automate onboard customer processes. This helped reduce time and engineer resources typical for the manual process.",
            "Led and fixed a critical issue over the Chrome v80 semi-silent release. I fixed multiple UI microapps across teams and gave guidance for future migration paths fixing blocked critical release paths. "
        ]
    },
    {
        "time": "MAY 2017 - NOV 2019",
        "company": "GE Aviation",
        "location": "Austin Tx",
        "title": "Senior Software Engineer",
        "summary": "",
        "points": [
            "As Lead UI, I designed and built both an offline capable desktop app using Electron and an online offering on Predix/Cloudfoundry. Both were built in Angular. ",
            "Delivered a custom gantt-like D3 component displaying line-of-flights critically required for the first GA release.",
            "Built a fully resettable static data POC used for Paris Air Show. From it’s success it was further used in future potential customer demos.",
            "I refactored the error handling and routing of the Angular apps for generic use. Built web components for shared usage across teams with different language support using Vue.js and a component library using Angular modules."
        ]
    },
    {
        "time": "DEC 2016 - MAY 2017",
        "company": "TEKsystems",
        "location": "Austin Tx",
        "title": "(Contract to Hire) Senior UI Engineer",
        "summary": "",
        "points": [
            "Brought in as an utility asset to fill the gap in UI.",
            "Working closely with another UI resource, we were able to close all the UI defects and enhancements in an aggressive timeline to bring the product to the first General Availability (GA) candidate release. ",
            "Mentored interns in learning UI technologies and framework."
        ]
    },
    {
        "time": "JUN 2011 - NOV 2016",
        "company": "Brinqa",
        "location": "Austin Tx",
        "title": "Software Engineer I/II",
        "summary": "",
        "points": [
           "Designed, owned and built questionnaire and assessment UI components. Featured multi tiered questions, dynamic dependent child questions with a focus on fluid responsive UI. Original design in jQuery, and then rewritten in AngularJS and eventually again in Angular 2.",
           "Had ownership of the middle tier and UI layer for the 4.x branch.",
           "Acted as Lead Support Engineer contact for several customers to facilitate customer sales followed by bugs and requests with development sprints."
        ]
    },
    {
        "time": "JAN 2011 - JUN 2011",
        "company": "Brinqa",
        "location": "Austin Tx",
        "title": "Intern",
        "summary": "",
        "points": [
            "Mentored under the UI Lead. As my semester goal/project, I was able to contribute by helping to create end to end the User CRUD from the middle tier and UI in Grails for our next version of the platform .",
            "My first duty was to expand on the unit testing framework, and complete out test branch paths."
        ]
    }
]